import numpy as np

a = np.array([1, 2, 3], dtype='float64')
a.dtype()
# dtype('float64') 
a.dtype = np.int32
a.size
# 3
a.itemsize
# 8  количество занимаем места в байтах


a = np.ones((3,4,5))
# array([[[1., 1., 1., 1., 1.],
#         [1., 1., 1., 1., 1.],
#         [1., 1., 1., 1., 1.],
#         [1., 1., 1., 1., 1.]],

#        [[1., 1., 1., 1., 1.],
#         [1., 1., 1., 1., 1.],
#         [1., 1., 1., 1., 1.],
#         [1., 1., 1., 1., 1.]],

#        [[1., 1., 1., 1., 1.],

a.ndin
# 3 количество осей
a.shape
# (3, 4, 5)
a.shape = 60
a.shape

#------------------------------------------------------------------------------
a = np.array((3,4,5))
b = a.view()
c = a.copy()
b[1] = 0
a
# array([3, 0, 5])
b
# array([3, 0, 5])
c
# array([3, 4, 5])


#-----------------------------------------------------------------------------
# № 5 Удаление и добавление элементов в массиве
#-----------------------------------------------------------------------------
a = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9])
a.shape = 2, 5
a
# array([[ 1,  2,  3,  4,  5],
#        [ 6,  7,  8,  9, 10]])
b = a.reshape(9)
b
# array([ 1,  2,  3,  4,  5,  6,  7,  8,  9])
# изменить в одном представлении измениться и в другом

a.shape = -1, 2
# если не по форме то закинет до конца

# преобразование двумерного массива в одномерный
a.reval()
a.shape = -1

a.resize(2, 5, refcheck=False) # меняет представление массива

#-------------------------------------------------------------
a.T


#-------------------------------------------------------------
# добавление новой оси
c = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9])
d = np.expand_dims(c, axis=0)
# array([[1, 2, 3, 4, 5, 6, 7, 8, 9]])

# добавление нового элемента
c = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9])
d = np.append(c, 10)
# array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])    

d.delete(0, axis=0)
# array([2, 3, 4, 5, 6, 7, 8, 9, 10])

e = np.array([[1], [1, 2], [1, 2, 3]], 0, axis=0)
e.squeeze() # удаляет гду на оси всего один элемент


#-------------------------------------------------------------
# newaxis
a = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9])
b = a[np.newaxis, :]
# array([[1, 2, 3, 4, 5, 6, 7, 8, 9]])
b = a[:, np.newaxis]
# array([[1],
#        [2],
#        [3],
#        [4],
#        [5],
#        [6],
#        [7],
#        [8],
#        [9]])

c = a[np.newaxis, :, np.newaxis]
# array([[[1],
#         [2],
#         [3],
#         [4],
#         [5],
#         [6],
#         [7],
#         [8],
#         [9]]])