import numpy as np


a = np.array([1,2,3])


for val in a.flat;
    print(val, end='')


#------------------------------------------------------
lst = list(1,2,3)
lst * 2
#[1, 2, 3, 1, 2, 3]

a = np.array([1,2,3])
a * 2
# array([2, 4, 6])

-a
# array([-1, -2, -3])

a -3 
# array([-2, -1,  0])

a + 2
# array([3, 4, 5])

#------------------------------------------------------
# все операции поэлементные это не матричные операции
b = np.array([1,2,3])

a + b
# array([2, 4, 6])


#------------------------------------------------------
# N 9
#------------------------------------------------------
 
a = np.array([1,2,3,4,5])
a > 2
# array([False, False,  True,  True,  True])

a[a>2]
# array([3, 4, 5])

np.greater(2, a)
# array([False, False,  True,  True,  True])

if np.array_equal(a, b):
    print(" a==b")
      
np.any(a>2)
# True хотя бы один элемент


#------------------------------------------------------
# N 11
#------------------------------------------------------
a = np.array([1,2,3], [4,5,6], [7,8,9])
b = np.array([1,2,3], [4,5,6], [7,8,9])

np.dot(a,b )
# array([[ 30,  36,  42],
#        [ 66,  81,  96],
#        [102, 126, 150]])

np.matmul(b,a )
# array([[ 30,  36,  42],   
#        [ 66,  81,  96],
#        [102, 126, 150]])

a = np.array([1,2,3,4,5])
b = np.array([1,2,3,4,5])

np.dot(a,b )
# 55    
np.inner(a,b )
# 55    
np.outer(a,b )
# array([[  1,   2,   3,   4,   5],
#        [  2,   4,   6,   8,  10],
#        [  3,   6,   9,  12,  15],
#        [  4,   8,  12,  16,  20],
#        [  5,  10,  15,  20,  25]])

a @ b
# 55

#------------------------------------------------------
a = np.array([1,2,3], [4,5,6], [7,8,9])
invA = np.linalg.inv(a)

invA @ ys

#------------------------------------------------------
# N12
#------------------------------------------------------
a = np.array([1,2,3,4,5])
a.unique(return_counts=True)
# (array([1, 2, 3, 4, 5]), array([1, 1, 1, 1, 1]))
a.unique(return_index=True)
# (array([1, 2, 3, 4, 5]), array([0, 1, 2, 3, 4]))
a.unique(return_inverse=True)
# (array([1, 2, 3, 4, 5]), array([0, 1, 2, 3, 4]))

# Операции над множествами

a = np.array([1,2,3,4,5])
b = np.array([3,4,5,6,7])

np.in1d(a,b)
# array([ True,  True,  True, False, False])
np.union1d(a,b)
# array([1, 2, 3, 4, 5, 6, 7])
np.intersect1d(a,b)
# array([3, 4, 5])
np.setdiff1d(a,b)
# array([1, 2])
np.setxor1d(a,b)
# array([1, 2, 6, 7])




#------------------------------------------------------
# N12 транслирвоание мссивов
#------------------------------------------------------
a = np.array([1,2,3,4,5])
b = np.array([2])

a + b   
# array([3, 4, 5, 6, 7])

b = np.array([2, 3])
a * b

a.ndim
# 1

