import numpy as np

a = np.array([1, 2], [3, 4])
b = np.array([5, 6], [7, 8])

np.hstack((a, b))
# array([[1, 2, 5, 6],
#        [3, 4, 7, 8]])

np.vstack((a, b))
# array([[1, 2],
#        [3, 4],
#        [5, 6],
#        [7, 8]])



c = np.fromiter(range(10), dtype=int)
d = np.fromiter(range(10, 20), dtype=int)
c.resize(2, 5)
d.resize(2, 5)
c.hstack(d)


#-------------------------------------------------------------

a = np.array([1, 2, 3, 4])
b = np.array([5, 6, 7, 8])

np.column_stack((a, b))
# array([[1, 5],
#        [2, 6],
#        [3, 7],
#        [4, 8]])

np.row_stack((a, b))
# array([[1, 2, 3, 4],
#        [5, 6, 7, 8]])


#--------------------------------------------------------------
a = np.arange(1, 13)
b = np.arange(13, 26)
a.resize(3,3,2)
b.resize(3,3,2)
c0 = np.concatenate((a, b), axis=0)
c1 = np.concatenate((a, b), axis=1)
c2 = np.concatenate((a, b), axis=2)
c0.shape
# (6, 3, 2)
c1.shape
# (3, 6, 2)
c2.shape
# (3, 3, 4)

np.dstack((a, b))
# array([[[ 1, 13],
#         [ 2, 14],
#         [ 3, 15]],
#
#        [[ 4, 16],
#         [ 5, 17],
#         [ 6, 18]],
#
#        [[ 7, 19],
#         [ 8, 20],
#         [ 9, 21]]])

#--------------------------------------------------------------
# делает объединение по первой оси а c_ по второй оси
np.r_[ [1,2,3],4,5]
# array([1, 2, 3, 4, 5])
np.r_[ 90:100 ,4,5].reshape(2,3)
# array([[90, 91, 92],
#        [93, 94, 95]])
np.r_[ np.array([1,2,3]),4,5, np.array([6,7,8]) ]
# array([1, 2, 3, 4, 5, 6, 7, 8])
np.r_[ [(1,2,3,), (4,5,6)], [7,8,9] ]
# array([[1, 2, 3],
#        [4, 5, 6],
#        [7, 8, 9]])

np.c_[ [(1,2,3,), (4,5,6)], [[7],[8]] ]
# array([[1, 2, 3, 7],
#        [4, 5, 6, 8]])

#--------------------------------------------------------------
a = np.arange(10)
a.hsplit(3)
# [array([0, 1, 2]), array([3, 4, 5]), array([6, 7, 8, 9])]

a.shape = 10, -1
a.vsplit(3)
# [array([0, 1, 2, 3, 4]), array([5, 6, 7, 8, 9])]


# array_split
